In [36]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [9]:
pd.DataFrame({'A':[1,2], 'B':[3,4], 'C': [5,6]}, index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [15]:
pd.DataFrame([[1,2,3], [4,5,6]], index=range(1,3), columns=["A","B","C"])

   A  B  C
1  1  2  3
2  4  5  6

In [23]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [28]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  53  86  80
1  91  40  75

In [37]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [54]:
id()

'VEUVk'

In [39]:
def score():
    return np.random.randint(0, 100)

In [40]:
score()

85

In [78]:
jum = [id() for i in range(10)]

In [86]:
ab = np.random.randint(score(), size=(10,4))

In [88]:
pd.DataFrame(np.random.randint(score(), size=(10,4)), index=[id() for i in range(10)], columns=["국어", "영어", "수학", "사회"])

       국어  영어  수학  사회
Sxfim  78  79  62  17
EXjNa  75  49  93  44
kszfP  14  25  54  29
TxPfk  10  82  65  31
YFPkK  31  51  56  56
WfLCI   3  34  32  67
hZXQa  48  85  24  16
yCWsK   8  28  80  52
ufGAv  43  58  93  54
xWxPB  32  50   1  59

In [74]:
com = [ id() for i in range(5) ]

In [76]:
print(com)

['PRPUX', 'zcsRV', 'IbqZJ', 'YaITX', 'ltEpW']